#У вас есть список numbers. Напишите программу, которая заполняет список числами от 0 до 100 и выводит его на экран.

list_of_numbers = []

for num in range(101):
    list_of_numbers.append(num)

print(list_of_numbers)